#                             运算符
# 算数运算符：+ - * / // % **  加,减,乘,除,整除,取余,求幂
# 关系运算符：> < == != >= <=  大于,小于,等于,不等于,大于等于,小于等于
# 赋值运算符：+= -= *= /= //= %= **= = 算术运算符的懒人版+基本赋值 
# 逻辑运算符：and or not    与   或   非 <后面再讲>
# 成员运算符：in , not in   在   不在    <后面再讲>
# 关系运算符：is , is not   是   不是    <后面再讲>

# 优先级：算数 > 关系 > 逻辑 > 赋值



# # 条件表达式仅有True False 两种结果
# # 逻辑表达式的 and or 左边单程的短路操作
# # 优先级：算数 > 关系 > 逻辑 > 赋值
# # 来个例题：
# # 输入学生的语文，数学，英语成绩,单科满分100分,
# # 一门100分   两门大于90   三门大于80  即可获得对应小红花
a = int(input())
b = int(input())
c = int(input())

d = a == 100 or b == 100 or c == 100
e = a > 90 and b > 90 or a > 90 and c > 90 or b > 90 and c > 90
f = a > 80 or b > 80 or c > 80

result = d or e or f
print(result)
